test/functional/cypress/fixtures/checkout/order--returningUserSingleSizeProd-visa.json

{
    "completedOrder": {
        "orderId": 8116001,
        "subTotal": "14.00",
        "returnPossible": false,
        "returnRequested": false,
        "deliveryMethod": "UK Standard up to 4 days",
        "deliveryDate": "Thursday 9 August 2018",
        "deliveryCost": "3.95",
        "deliveryCarrier": "Parcelnet",
        "deliveryPrice": "3.95",
        "totalOrderPrice": "17.95",
        "totalOrdersDiscountLabel": "",
        "totalOrdersDiscount": "",
        "ddpPromotion": {},
        "billingAddress": {
            "address1": "Arcadia Group Ltd",
            "name": "Mr dsaf asdfsdf",
            "country": "United Kingdom",
            "address2": "Colegrave House, 68-70 Berners Street",
            "address3": "LONDON",
            "address4": "W1T 3NL"
        },
        "deliveryAddress": {
            "address1": "Arcadia Group Ltd",
            "name": "Mr dsaf asdfsdf",
            "country": "United Kingdom",
            "address2": "Colegrave House, 68-70 Berners Street",
            "address3": "LONDON",
            "address4": "W1T 3NL"
        },
        "orderLines": [
            {
                "lineNo": "19H11NBLK",
                "name": "Black Bucket Hat",
                "size": "",
                "colour": "BLACK",
                "imageUrl":
                    "https://ts-tst1.tst.digital.arcadiagroup.co.uk/wcsstore/TopShop/images/catalog/TS19H11NBLK_Small_M_1.jpg",
                "quantity": 1,
                "unitPrice": "14.00",
                "discount": "",
                "discountPrice": "0.00",
                "total": "14.00",
                "nonRefundable": false
            }
        ],
        "paymentDetails": [
            {
                "paymentMethod": "Visa",
                "cardNumberStar": "************1111",
                "totalCost": "£17.95"
            }
        ],
        "currencyConversion": {"currencyRate": "GBP"},
        "returning_buyer": true,
        "eMarketingEspot1URL": {
            "contentText":
                "%3C%21--+New+Customer+Trigger--%3E%0A%3Cscript+type%3D%22text%2Fjavascript%22%3E%0Avar+existingcust+%3D+%22Sale-New%22%0A%3C%2Fscript%3E"
        }
    }
}
